<template>
  <div class="main">
    <h2>Тестовое задание Front-end</h2>

    <h4>Необходимо создать СПА на Vue.js. СПА должно поддерживать маршрутизацию посредством vue-
      router и иметь хранилище состояния, реализованное через Vuex.Шапка приложения должна содержать следующие ссылки
      маршрутов:
    </h4>

    <h5>1) “Главная” – статическая страница, на которой выводится текст данного ТЗ без картинок.
      </br> 2) “Вакууматоры” и “Дозаторы” страницы, на которых выводится таблица с товарами. Таблица
      содержит следующие столбцы: изображение, наименование, наличие и цена.</br>

      Данные для таблицы получаются через API методом POST по адресу
      <a href="https://dev.alcotec.com.ua/api/products/ID">https://dev.alcotec.com.ua/api/products/ID</a>, тело запроса
      должно содержать следующие
      параметры:</br>
      sorting: { sortBy: "rating", isDesc: true},</br>
      page: 1,</br>
      perpage: 15,</br>
      filter: {},</br>
      Для вакууматоров ID = 322, дозаторов - 103.</br>
      Url для доступа к изображениям https://dev.alcotec.com.ua</br>
      В api реализовано несколько видов сортировок, НО вам необходимо реализовать сортировку
      самостоятельно, на фронте, без запроса к api и использования библиотек сторонних
      разработчиков. Сортировка должна быть реализована по параметру “Цена”. При загрузке
      сортировка должна быть как в запросе – по рейтингу. По клику на “Цена” – товары должны
      сортироваться по ниспадающей цене, при повторном клике – по возрастающей.</br>
      3) “Условия возврата” и “Условия оплаты” – страницы, на которых выводится готовый
      статический контент с сервера посредством запроса к API методом GET по адресу
      <a href="https://dev.alcotec.com.ua/api/pages/alias">https://dev.alcotec.com.ua/api/pages/alias</a>. Для условий
      возврата alias: purchase-returns, для
      оплаты – payment. На страницах необходимо вывести наименование страницы в теге H1 и
      контент в отдельном блоке.</br>
      4) Страница 404. Для всех несуществующих роутов или при ответе сервера при запросе
      несуществующей страницы – переадресовывать на страницу 404.</br>
    </h5>
    <h5>В ответах от сервера, многие текстовые поля приходят на двух языках, для выполнения этого
      задания нужно брать статически только данные с индексом ‘ru’, где это необходимо.
      В хранилище не должно хранится ничего лишнего, кроме критически важного состояния, нужных
      мутаций и необходимых экшенов (предполагается что хранилище будет использовано для
      отправки, обработки и хранения данных с запросов). Результат выполнения должен быть залит на
      git. Репозиторий не должен содержать один единственный комит. У вас должен быть как
      минимум инициирующий комит – после создания и полной настройки проекта, и по комиту
      после завершения каждого пункта задания. Последовательность выполнения пунктов на ваше
      усмотрение.</h5>
    Main
  </div>
</template>

<script>
  export default {
    name: "Main"
  }
</script>

<style scoped lang="scss">
  .main {
    width: 50vw;
    margin: 50px auto 0;

    h4, h5 {
      margin-top: 20px;
      text-align: left;
    }
  }
</style>
